export type TAuthItem = {
  id?: string;
  pId?: string;
  pTitle?: string;
  title?: string;
};

// export const AUTH_LIST: TAuthItem[] = [
//   /** 企业管理 */
//   { id: '1', title: '企业管理-页面' },
//   { id: '1-0', title: '查询', pId: '1' },
//   { id: '1-1', title: '编辑', pId: '1' },
//   { id: '1-2', title: '新建', pId: '1' },
//   { id: '1-3', title: '删除', pId: '1' },

//   /** 企业详情 */
//   { id: '1-4', title: '企业详情', pId: '1' },
//   { id: '1-4-0', title: '查询', pId: '1-4' },

//   /** 项目详情(问卷) */
//   { id: '1-4-1', title: '项目详情(问卷)', pId: '1-4' },
//   { id: '1-4-1-0', title: '查询', pId: '1-4-1' },
//   { id: '1-4-1-1', title: '导出', pId: '1-4-1' },
//   { id: '1-4-1-2', title: '问卷详情', pId: '1-4-1' },
//   { id: '1-4-1-3', title: '上传调研报告', pId: '1-4-1' },
//   { id: '1-4-1-4', title: '上传调研简报', pId: '1-4-1' },

//   /** (问卷)名额申请审核 */
//   { id: '1-4-1-5', title: '名额申请审核', pId: '1-4-1' },
//   { id: '1-4-1-5-0', title: '查询', pId: '1-4-1-5' },
//   { id: '1-4-1-5-1', title: '导出', pId: '1-4-1-5' },
//   { id: '1-4-1-5-2', title: '通过', pId: '1-4-1-5' },
//   { id: '1-4-1-5-3', title: '拒绝', pId: '1-4-1-5' },
//   { id: '1-4-1-5-4', title: '查看照片', pId: '1-4-1-5' },

//   /** (问卷)项目医生列表 */
//   { id: '1-4-1-6', title: '项目医生列表', pId: '1-4-1' },
//   { id: '1-4-1-6-0', title: '查询', pId: '1-4-1-6' },
//   { id: '1-4-1-6-1', title: '导出', pId: '1-4-1-6' },

//   /** 项目详情(访谈) */
//   { id: '1-4-2', title: '项目详情(访谈)', pId: '1-4' },
//   { id: '1-4-2-0', title: '查询', pId: '1-4-2' },
//   { id: '1-4-2-1', title: '上传调研报告', pId: '1-4-2' },
//   { id: '1-4-2-2', title: '上传调研简报', pId: '1-4-2' },
//   { id: '1-4-2-3', title: '数据-仅查看自己', pId: '1-4-2' },

//   /** (访谈)名额申请审核 */
//   { id: '1-4-2-4', title: '名额申请审核', pId: '1-4-2' },
//   { id: '1-4-2-4-0', title: '查询', pId: '1-4-2-4' },
//   { id: '1-4-2-4-1', title: '导出', pId: '1-4-2-4' },
//   { id: '1-4-2-4-2', title: '通过', pId: '1-4-2-4' },
//   { id: '1-4-2-4-3', title: '拒绝', pId: '1-4-2-4' },
//   { id: '1-4-2-4-4', title: '查看照片', pId: '1-4-2-4' },

//   /** (访谈)项目医生列表 */
//   { id: '1-4-2-5', title: '项目医生列表', pId: '1-4-2' },
//   { id: '1-4-2-5-0', title: '查询', pId: '1-4-2-5' },
//   { id: '1-4-2-5-1', title: '导出', pId: '1-4-2-5' },

//   /** 号源信息 */
//   { id: '1-4-2-6', title: '号源信息', pId: '1-4-2' },
//   { id: '1-4-2-6-0', title: '查询', pId: '1-4-2-6' },
//   { id: '1-4-2-6-1', title: '新增号源', pId: '1-4-2-6' },
//   { id: '1-4-2-6-2', title: '批量导入', pId: '1-4-2-6' },
//   { id: '1-4-2-6-3', title: '编辑', pId: '1-4-2-6' },
//   { id: '1-4-2-6-4', title: '删除', pId: '1-4-2-6' },

//   /** 访谈详情 */
//   { id: '1-4-2-7', title: '访谈详情', pId: '1-4-2' },
//   { id: '1-4-2-7-0', title: '签到', pId: '1-4-2-7' },
//   { id: '1-4-2-7-1', title: '确认预约', pId: '1-4-2-7' },
//   { id: '1-4-2-7-2', title: '修改预约时间', pId: '1-4-2-7' },
//   { id: '1-4-2-7-3', title: '取消预约', pId: '1-4-2-7' },
//   { id: '1-4-2-7-4', title: '完成访谈', pId: '1-4-2-7' },
//   { id: '1-4-2-7-5', title: '重新预约', pId: '1-4-2-7' },

//   /** 商城管理 */
//   { id: '2', title: '商城管理' },
//   { id: '2-0', title: '查询', pId: '2' },
//   { id: '2-1', title: '导出', pId: '2' },
//   { id: '2-2', title: '上传商品', pId: '2' },
//   { id: '2-3', title: '编辑商品', pId: '2' },
//   { id: '2-4', title: '删除', pId: '2' },

//   /** 库存信息 */
//   { id: '2-5', title: '库存信息', pId: '2' },
//   { id: '2-5-0', title: '查询', pId: '2-5' },
//   { id: '2-5-1', title: '导出', pId: '2-5' },
//   { id: '2-5-2', title: '批量导入', pId: '2-5' },

//   /** 信息审核 */
//   { id: '3', title: '信息审核' },

//   /** 小火苗信息审核 */
//   { id: '3-0', title: '小火苗信息审核-页面', pId: '3' },
//   { id: '3-0-0', title: '查询', pId: '3-0' },
//   { id: '3-0-1', title: '导出', pId: '3-0' },
//   { id: '3-0-2', title: '通过', pId: '3-0' },
//   { id: '3-0-3', title: '拒绝', pId: '3-0' },
//   { id: '3-0-4', title: '查看照片', pId: '3-0' },

//   /** 对接医院信息 */
//   { id: '3-0-5', title: '对接医院信息', pId: '3-0' },
//   { id: '3-0-5-0', title: '查询', pId: '3-0-5' },
//   { id: '3-0-5-1', title: '导出', pId: '3-0-5' },
//   { id: '3-0-5-2', title: '关联医院', pId: '3-0-5' },

//   /** 对接医生信息 */
//   { id: '3-0-6', title: '对接医院信息', pId: '3-0' },
//   { id: '3-0-6-0', title: '查询', pId: '3-0-6' },
//   { id: '3-0-6-1', title: '导出', pId: '3-0-6' },
//   { id: '3-0-6-2', title: '关联医院', pId: '3-0-6' },

//   //   /** 内容管理 */
//   //   { id: '4', title: '内容管理' },

//   //   /** 小火苗信息审核 */
//   //   { id: '3-0', title: '小火苗信息审核',pId: '3' },
//   //   { id: '3-0-0', title: '查询', pId: '3-0' },
//   //   { id: '3-0-1', title: '导出', pId: '3-0' },
//   //   { id: '3-0-2', title: '通过', pId: '3-0' },
//   //   { id: '3-0-3', title: '拒绝', pId: '3-0' },
//   //   { id: '3-0-4', title: '查看照片', pId: '3-0' },
// ];

export const AUTH_LIST: TAuthItem[] = [
  /** 企业管理 */
  { id: '1', title: '企业管理' },

  /** 商城管理 */
  { id: '2', title: '商城管理' },

  /** 信息审核 */
  { id: '3', title: '信息审核' },

  /** 小火苗信息审核 */
  { id: '3-0', title: '小火苗信息审核', pId: '3', pTitle: '信息审核' },
  /** 注销账号记录 */
  { id: '3-1', title: '注销账号记录', pId: '3', pTitle: '信息审核' },

  /** 内容管理 */
  { id: '4', title: '内容管理' },

  /** 医生管理 */
  { id: '4-1', title: '医生管理', pId: '4', pTitle: '内容管理' },
  /** 医院管理 */
  { id: '4-2', title: '医院管理', pId: '4', pTitle: '内容管理' },
  /** 科室管理 */
  { id: '4-3', title: '科室管理', pId: '4', pTitle: '内容管理' },
  /** 领域管理 */
  { id: '4-4', title: '领域管理', pId: '4', pTitle: '内容管理' },

  /** 财务统计 */
  { id: '5', title: '财务统计' },

  /** 业务报表 */
  { id: '5-1', title: '业务报表', pId: '5', pTitle: '财务统计' },
  /** 支付报表 */
  { id: '5-2', title: '支付报表', pId: '5', pTitle: '财务统计' },

  /** 权限管理 */
  { id: '6', title: '权限管理' },

  /** 人员管理 */
  { id: '6-1', title: '人员管理', pId: '6', pTitle: '权限管理' },
  /** 角色管理 */
  { id: '6-2', title: '角色管理', pId: '6', pTitle: '权限管理' },
];
